
####################
# IMPORTANT: Ensure to follow the User Guide instructions for implementing and using Shape-IoU properly.
####################

# Parameters
nc: 4 # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6
  - [-1, 1, SPPF, [512, 5]] # 7
  - [-1, 2, C2PSA, [512]] # 8

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
  - [-1, 1, CBAM, [256]]  # 10
  - [[-1, 4], 1, Concat, [1]] # 11 cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [-1, 1, CBAM, [128]]  # 14
  - [[-1, 2], 1, Concat, [1]] # 15 cat backbone P2
  - [-1, 2, C3k2, [128, False]] # 16 (P2/4-small)

  - [-1, 1, Conv, [256, 3, 2]] # 17
  - [[-1, 12], 1, Concat, [1]] # 18 cat head P3
  - [-1, 2, C3k2, [256, False]] # 19 (P3/8-small)

  - [-1, 1, Conv, [512, 3, 2]] # 20
  - [[-1, 8], 1, Concat, [1]] # 21 cat head P5
  - [-1, 2, C3k2, [512, True]] # 22 (P4/16-medium)

  - [[16, 19, 22], 1, Detect, [nc]] # 23 Detect(P2, P3, P4)
